RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_gpu_regs.h
/*
 * FSCALE_CMD_LOAD (RW)
 *
 * core clock frequency scale value enable
 */
#define GPU_AQHICLOCKCONTROL_FSCALE_CMD_LOAD_MASK (0x200U)
#define GPU_AQHICLOCKCONTROL_FSCALE_CMD_LOAD_SHIFT (9U)
#define GPU_AQHICLOCKCONTROL_FSCALE_CMD_LOAD_SET(x) (((uint32_t)(x) << GPU_AQHICLOCKCONTROL_FSCALE_CMD_LOAD_SHIFT) & GPU_AQHICLOCKCONTROL_FSCALE_CMD_LOAD_MASK)
#define GPU_AQHICLOCKCONTROL_FSCALE_CMD_LOAD_GET(x) (((uint32_t)(x) & GPU_AQHICLOCKCONTROL_FSCALE_CMD_LOAD_MASK) >> GPU_AQHICLOCKCONTROL_FSCALE_CMD_LOAD_SHIFT)

/*
 * FSCALE_VAL (RW)
 *
 * core clock frequency scale value
 */
#define GPU_AQHICLOCKCONTROL_FSCALE_VAL_MASK (0x1FCU)
#define GPU_AQHICLOCKCONTROL_FSCALE_VAL_SHIFT (2U)
#define GPU_AQHICLOCKCONTROL_FSCALE_VAL_SET(x) (((uint32_t)(x) << GPU_AQHICLOCKCONTROL_FSCALE_VAL_SHIFT) & GPU_AQHICLOCKCONTROL_FSCALE_VAL_MASK)
#define GPU_AQHICLOCKCONTROL_FSCALE_VAL_GET(x) (((uint32_t)(x) & GPU_AQHICLOCKCONTROL_FSCALE_VAL_MASK) >> GPU_AQHICLOCKCONTROL_FSCALE_VAL_SHIFT)

/*
 * CLK2D_DIS (RW)
 *
 * disable 2D/VG clock
 */
#define GPU_AQHICLOCKCONTROL_CLK2D_DIS_MASK (0x2U)
#define GPU_AQHICLOCKCONTROL_CLK2D_DIS_SHIFT (1U)
#define GPU_AQHICLOCKCONTROL_CLK2D_DIS_SET(x) (((uint32_t)(x) << GPU_AQHICLOCKCONTROL_CLK2D_DIS_SHIFT) & GPU_AQHICLOCKCONTROL_CLK2D_DIS_MASK)
#define GPU_AQHICLOCKCONTROL_CLK2D_DIS_GET(x) (((uint32_t)(x) & GPU_AQHICLOCKCONTROL_CLK2D_DIS_MASK) >> GPU_AQHICLOCKCONTROL_CLK2D_DIS_SHIFT)

/* Bitfield definition for register: AQHILDLE */
/*
 * AXI_LP (R)
 *
 * axi is in low power mode
 */
#define GPU_AQHILDLE_AXI_LP_MASK (0x80000000UL)
#define GPU_AQHILDLE_AXI_LP_SHIFT (31U)
#define GPU_AQHILDLE_AXI_LP_GET(x) (((uint32_t)(x) & GPU_AQHILDLE_AXI_LP_MASK) >> GPU_AQHILDLE_AXI_LP_SHIFT)

/*
 * IDLE_BLT (R)
 *
 * BLT is idle or not present
 */
#define GPU_AQHILDLE_IDLE_BLT_MASK (0x1000U)
#define GPU_AQHILDLE_IDLE_BLT_SHIFT (12U)
#define GPU_AQHILDLE_IDLE_BLT_GET(x) (((uint32_t)(x) & GPU_AQHILDLE_IDLE_BLT_MASK) >> GPU_AQHILDLE_IDLE_BLT_SHIFT)

/*
 * IDLE_TS (R)
 *
 * Tessellation Engine is idle
 */
#define GPU_AQHILDLE_IDLE_TS_MASK (0x800U)
#define GPU_AQHILDLE_IDLE_TS_SHIFT (11U)
#define GPU_AQHILDLE_IDLE_TS_GET(x) (((uint32_t)(x) & GPU_AQHILDLE_IDLE_TS_MASK) >> GPU_AQHILDLE_IDLE_TS_SHIFT)

/*
 * IDLE_FP (R)
 *
 * FP is idle or not present
 */
#define GPU_AQHILDLE_IDLE_FP_MASK (0x400U)
#define GPU_AQHILDLE_IDLE_FP_SHIFT (10U)
#define GPU_AQHILDLE_IDLE_FP_GET(x) (((uint32_t)(x) & GPU_AQHILDLE_IDLE_FP_MASK) >> GPU_AQHILDLE_IDLE_FP_SHIFT)

/*
 * IDLE_IM (R)
 *
 * Image Engine is idle
 */
#define GPU_AQHILDLE_IDLE_IM_MASK (0x200U)
#define GPU_AQHILDLE_IDLE_IM_SHIFT (9U)
#define GPU_AQHILDLE_IDLE_IM_GET(x) (((uint32_t)(x) & GPU_AQHILDLE_IDLE_IM_MASK) >> GPU_AQHILDLE_IDLE_IM_SHIFT)

/*
 * IDLE_VG (R)
 *
 * Vector Graphics Engine is idle
 */
#define GPU_AQHILDLE_IDLE_VG_MASK (0x100U)
#define GPU_AQHILDLE_IDLE_VG_SHIFT (8U)
#define GPU_AQHILDLE_IDLE_VG_GET(x) (((uint32_t)(x) & GPU_AQHILDLE_IDLE_VG_MASK) >> GPU_AQHILDLE_IDLE_VG_SHIFT)

/*
 * IDLE_TX (R)
 *
 * TX is idle or not present
 */
#define GPU_AQHILDLE_IDLE_TX_MASK (0x80U)
#define GPU_AQHILDLE_IDLE_TX_SHIFT (7U)
#define GPU_AQHILDLE_IDLE_TX_GET(x) (((uint32_t)(x) & GPU_AQHILDLE_IDLE_TX_MASK) >> GPU_AQHILDLE_IDLE_TX_SHIFT)

/*
 * IDLE_RA (R)
 *
 * RA is idle or not present
 */
#define GPU_AQHILDLE_IDLE_RA_MASK (0x40U)
#define GPU_AQHILDLE_IDLE_RA_SHIFT (6U)
#define GPU_AQHILDLE_IDLE_RA_GET(x) (((uint32_t)(x) & GPU_AQHILDLE_IDLE_RA_MASK) >> GPU_AQHILDLE_IDLE_RA_SHIFT)

/*
 * IDLE_SE (R)
 *
 * SE is idle or not present
 */
#define GPU_AQHILDLE_IDLE_SE_MASK (0x20U)
#define GPU_AQHILDLE_IDLE_SE_SHIFT (5U)
#define GPU_AQHILDLE_IDLE_SE_GET(x) (((uint32_t)(x) & GPU_AQHILDLE_IDLE_SE_MASK) >> GPU_AQHILDLE_IDLE_SE_SHIFT)

/*
 * IDLE_PA (R)
 *
 * PA is idle or not present
 */
#define GPU_AQHILDLE_IDLE_PA_MASK (0x10U)
#define GPU_AQHILDLE_IDLE_PA_SHIFT (4U)
#define GPU_AQHILDLE_IDLE_PA_GET(x) (((uint32_t)(x) & GPU_AQHILDLE_IDLE_PA_MASK) >> GPU_AQHILDLE_IDLE_PA_SHIFT)

/*
 * IDLE_SH (R)
 *
 * SH is idle or not present
 */
#define GPU_AQHILDLE_IDLE_SH_MASK (0x8U)
#define GPU_AQHILDLE_IDLE_SH_SHIFT (3U)
#define GPU_AQHILDLE_IDLE_SH_GET(x) (((uint32_t)(x) & GPU_AQHILDLE_IDLE_SH_MASK) >> GPU_AQHILDLE_IDLE_SH_SHIFT)

/*
 * IDLE_PE (R)
 *
 * Pixel engine is idle
 */
#define GPU_AQHILDLE_IDLE_PE_MASK (0x4U)
#define GPU_AQHILDLE_IDLE_PE_SHIFT (2U)
#define GPU_AQHILDLE_IDLE_PE_GET(x) (((uint32_t)(x) & GPU_AQHILDLE_IDLE_PE_MASK) >> GPU_AQHILDLE_IDLE_PE_SHIFT)

/*
 * IDLE_DE (R)
 *
 * DE is dile or not present
 */
#define GPU_AQHILDLE_IDLE_DE_MASK (0x2U)
#define GPU_AQHILDLE_IDLE_DE_SHIFT (1U)
#define GPU_AQHILDLE_IDLE_DE_GET(x) (((uint32_t)(x) & GPU_AQHILDLE_IDLE_DE_MASK) >> GPU_AQHILDLE_IDLE_DE_SHIFT)

/*
 * IDLE_FE (R)
 *
 * 0: fetch engine is busy  1:fetch engine is idle
 */
#define GPU_AQHILDLE_IDLE_FE_MASK (0x1U)
#define GPU_AQHILDLE_IDLE_FE_SHIFT (0U)
#define GPU_AQHILDLE_IDLE_FE_GET(x) (((uint32_t)(x) & GPU_AQHILDLE_IDLE_FE_MASK) >> GPU_AQHILDLE_IDLE_FE_SHIFT)

/* Bitfield definition for register: AQINTRACKNOWLEDGE */
/*
 * INTR_VEC (R)
 *
 * for each interrupt event, 0=clear,1=interrupt active
 */
#define GPU_AQINTRACKNOWLEDGE_INTR_VEC_MASK (0xFFFFFFFFUL)
#define GPU_AQINTRACKNOWLEDGE_INTR_VEC_SHIFT (0U)
#define GPU_AQINTRACKNOWLEDGE_INTR_VEC_GET(x) (((uint32_t)(x) & GPU_AQINTRACKNOWLEDGE_INTR_VEC_MASK) >> GPU_AQINTRACKNOWLEDGE_INTR_VEC_SHIFT)

/* Bitfield definition for register: AQINTRENBL */
/*
 * INTR_ENBL_VEC (RW)
 *
 * 0=disable interrupt; 1=enable interrupt
 */
#define GPU_AQINTRENBL_INTR_ENBL_VEC_MASK (0xFFFFFFFFUL)
#define GPU_AQINTRENBL_INTR_ENBL_VEC_SHIFT (0U)
#define GPU_AQINTRENBL_INTR_ENBL_VEC_SET(x) (((uint32_t)(x) << GPU_AQINTRENBL_INTR_ENBL_VEC_SHIFT) & GPU_AQINTRENBL_INTR_ENBL_VEC_MASK)
#define GPU_AQINTRENBL_INTR_ENBL_VEC_GET(x) (((uint32_t)(x) & GPU_AQINTRENBL_INTR_ENBL_VEC_MASK) >> GPU_AQINTRENBL_INTR_ENBL_VEC_SHIFT)

/* Bitfield definition for register: GCCHIPREV */
/*
 * REV (R)
 *
 * revision
 */
#define GPU_GCCHIPREV_REV_MASK (0xFFFFFFFFUL)
#define GPU_GCCHIPREV_REV_SHIFT (0U)
#define GPU_GCCHIPREV_REV_GET(x) (((uint32_t)(x) & GPU_GCCHIPREV_REV_MASK) >> GPU_GCCHIPREV_REV_SHIFT)

/* Bitfield definition for register: GCCHIPDATE */
/*
 * DATE (R)
 *
 * date
 */
#define GPU_GCCHIPDATE_DATE_MASK (0xFFFFFFFFUL)
#define GPU_GCCHIPDATE_DATE_SHIFT (0U)
#define GPU_GCCHIPDATE_DATE_GET(x) (((uint32_t)(x) & GPU_GCCHIPDATE_DATE_MASK) >> GPU_GCCHIPDATE_DATE_SHIFT)

/* Bitfield definition for register: GCREGHICHIPPATCHREV */
/*
 * PATCH_REV (R)
 *
 * patch revision
 */
#define GPU_GCREGHICHIPPATCHREV_PATCH_REV_MASK (0xFFU)
#define GPU_GCREGHICHIPPATCHREV_PATCH_REV_SHIFT (0U)
#define GPU_GCREGHICHIPPATCHREV_PATCH_REV_GET(x) (((uint32_t)(x) & GPU_GCREGHICHIPPATCHREV_PATCH_REV_MASK) >> GPU_GCREGHICHIPPATCHREV_PATCH_REV_SHIFT)

/* Bitfield definition for register: GCPRODUCTID */
/*
 * TYPE (R)
 *
 * product type is 3:VG
 */
#define GPU_GCPRODUCTID_TYPE_MASK (0xF000000UL)
#define GPU_GCPRODUCTID_TYPE_SHIFT (24U)
#define GPU_GCPRODUCTID_TYPE_GET(x) (((uint32_t)(x) & GPU_GCPRODUCTID_TYPE_MASK) >> GPU_GCPRODUCTID_TYPE_SHIFT)

