RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_gpu_regs.h
/*
 * FAST_WTC (RW)
 *
 * WTC for fast rams
 */
#define GPU_AQREGISTERTIMINGCONTROL_FAST_WTC_MASK (0xC0000UL)
#define GPU_AQREGISTERTIMINGCONTROL_FAST_WTC_SHIFT (18U)
#define GPU_AQREGISTERTIMINGCONTROL_FAST_WTC_SET(x) (((uint32_t)(x) << GPU_AQREGISTERTIMINGCONTROL_FAST_WTC_SHIFT) & GPU_AQREGISTERTIMINGCONTROL_FAST_WTC_MASK)
#define GPU_AQREGISTERTIMINGCONTROL_FAST_WTC_GET(x) (((uint32_t)(x) & GPU_AQREGISTERTIMINGCONTROL_FAST_WTC_MASK) >> GPU_AQREGISTERTIMINGCONTROL_FAST_WTC_SHIFT)

/*
 * FAST_RTC (RW)
 *
 * RTC for fast rams
 */
#define GPU_AQREGISTERTIMINGCONTROL_FAST_RTC_MASK (0x30000UL)
#define GPU_AQREGISTERTIMINGCONTROL_FAST_RTC_SHIFT (16U)
#define GPU_AQREGISTERTIMINGCONTROL_FAST_RTC_SET(x) (((uint32_t)(x) << GPU_AQREGISTERTIMINGCONTROL_FAST_RTC_SHIFT) & GPU_AQREGISTERTIMINGCONTROL_FAST_RTC_MASK)
#define GPU_AQREGISTERTIMINGCONTROL_FAST_RTC_GET(x) (((uint32_t)(x) & GPU_AQREGISTERTIMINGCONTROL_FAST_RTC_MASK) >> GPU_AQREGISTERTIMINGCONTROL_FAST_RTC_SHIFT)

/*
 * FOR_RF2P (RW)
 *
 * for 2 port ram
 */
#define GPU_AQREGISTERTIMINGCONTROL_FOR_RF2P_MASK (0xFF00U)
#define GPU_AQREGISTERTIMINGCONTROL_FOR_RF2P_SHIFT (8U)
#define GPU_AQREGISTERTIMINGCONTROL_FOR_RF2P_SET(x) (((uint32_t)(x) << GPU_AQREGISTERTIMINGCONTROL_FOR_RF2P_SHIFT) & GPU_AQREGISTERTIMINGCONTROL_FOR_RF2P_MASK)
#define GPU_AQREGISTERTIMINGCONTROL_FOR_RF2P_GET(x) (((uint32_t)(x) & GPU_AQREGISTERTIMINGCONTROL_FOR_RF2P_MASK) >> GPU_AQREGISTERTIMINGCONTROL_FOR_RF2P_SHIFT)

/*
 * FOR_RF1P (RW)
 *
 * for 1 port ram
 */
#define GPU_AQREGISTERTIMINGCONTROL_FOR_RF1P_MASK (0xFFU)
#define GPU_AQREGISTERTIMINGCONTROL_FOR_RF1P_SHIFT (0U)
#define GPU_AQREGISTERTIMINGCONTROL_FOR_RF1P_SET(x) (((uint32_t)(x) << GPU_AQREGISTERTIMINGCONTROL_FOR_RF1P_SHIFT) & GPU_AQREGISTERTIMINGCONTROL_FOR_RF1P_MASK)
#define GPU_AQREGISTERTIMINGCONTROL_FOR_RF1P_GET(x) (((uint32_t)(x) & GPU_AQREGISTERTIMINGCONTROL_FOR_RF1P_MASK) >> GPU_AQREGISTERTIMINGCONTROL_FOR_RF1P_SHIFT)

/* Bitfield definition for register: GCREGFETCHADDRESS */
/*
 * ADDRESS (RW)
 *
 * address of command buffer
 */
#define GPU_GCREGFETCHADDRESS_ADDRESS_MASK (0xFFFFFFFCUL)
#define GPU_GCREGFETCHADDRESS_ADDRESS_SHIFT (2U)
#define GPU_GCREGFETCHADDRESS_ADDRESS_SET(x) (((uint32_t)(x) << GPU_GCREGFETCHADDRESS_ADDRESS_SHIFT) & GPU_GCREGFETCHADDRESS_ADDRESS_MASK)
#define GPU_GCREGFETCHADDRESS_ADDRESS_GET(x) (((uint32_t)(x) & GPU_GCREGFETCHADDRESS_ADDRESS_MASK) >> GPU_GCREGFETCHADDRESS_ADDRESS_SHIFT)

/*
 * TYPE (RW)
 *
 * 0=system  2=vritual 1=local
 */
#define GPU_GCREGFETCHADDRESS_TYPE_MASK (0x3U)
#define GPU_GCREGFETCHADDRESS_TYPE_SHIFT (0U)
#define GPU_GCREGFETCHADDRESS_TYPE_SET(x) (((uint32_t)(x) << GPU_GCREGFETCHADDRESS_TYPE_SHIFT) & GPU_GCREGFETCHADDRESS_TYPE_MASK)
#define GPU_GCREGFETCHADDRESS_TYPE_GET(x) (((uint32_t)(x) & GPU_GCREGFETCHADDRESS_TYPE_MASK) >> GPU_GCREGFETCHADDRESS_TYPE_SHIFT)

/* Bitfield definition for register: GCREGFETCHCONTROL */
/*
 * COUNT (RW)
 *
 * number of 64bit words to fetch
 */
#define GPU_GCREGFETCHCONTROL_COUNT_MASK (0x1FFFFFUL)
#define GPU_GCREGFETCHCONTROL_COUNT_SHIFT (0U)
#define GPU_GCREGFETCHCONTROL_COUNT_SET(x) (((uint32_t)(x) << GPU_GCREGFETCHCONTROL_COUNT_SHIFT) & GPU_GCREGFETCHCONTROL_COUNT_MASK)
#define GPU_GCREGFETCHCONTROL_COUNT_GET(x) (((uint32_t)(x) & GPU_GCREGFETCHCONTROL_COUNT_MASK) >> GPU_GCREGFETCHCONTROL_COUNT_SHIFT)

/* Bitfield definition for register: GCREGCURRENTFETCHADDRESS */
/*
 * ADDRESS (R)
 *
 * address
 */
#define GPU_GCREGCURRENTFETCHADDRESS_ADDRESS_MASK (0xFFFFFFFFUL)
#define GPU_GCREGCURRENTFETCHADDRESS_ADDRESS_SHIFT (0U)
#define GPU_GCREGCURRENTFETCHADDRESS_ADDRESS_GET(x) (((uint32_t)(x) & GPU_GCREGCURRENTFETCHADDRESS_ADDRESS_MASK) >> GPU_GCREGCURRENTFETCHADDRESS_ADDRESS_SHIFT)




#endif /* HPM_GPU_H */
